W7D2/MusicApp/app/models/user.rb

    def self.find_by_credentails(email, password)
        user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "LiloandStitch@aloha.com"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "d1mFRZi9yzinMjCRhWJw8A"], ["updated_at", "2021-08-18 00:01:20.786958"], ["id", 1]]