W6D4/routes_v2/app/controllers/artwork_shares_controller.rb

    def create
        artwork_share = ArtworkShare.new(artwork_shares_params)
        artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES (?, ?)  [["artwork_id", 1], ["viewer_id", 1]]

    def destroy
        artwork_share = ArtworkShare.find(params[:id])
        artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = ?  [["id", 1]]