W6D4/routes_v2/app/controllers/comments_controller.rb

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body") VALUES (?, ?, ?)  [["user_id", 1], ["artwork_id", 1], ["body", "This looks nice"]]