W6D4/routes_v2/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."username" = ?  [["username", "jimmy"]]
---
    def index
        # users can search for other users by name
        # check if a query is present in the request params.
        @user = User.all
        if params.has_key?("username")
            @user = User.where(username: params[:username])

INSERT INTO "users" ("name", "email") VALUES (?, ?)  [["name", "Danny"], ["email", "danny@gmail.com"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = ? WHERE "users"."id" = ?  [["username", "Johnny"], ["id", 3]]
---
    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
    def destroy
        user = User.find_by(id: params[:id])
        if user.destroy