W11D2/todolist/app/controllers/api/todos_controller.rb

    def index
        render json: Todo.all
---
SELECT "todos".* FROM "todos"