W12D2/BenchBnb/app/controllers/api/benches_controller.rb

    def index
        @benches = Bench.all
---
SELECT "benches".* FROM "benches"