W6D3/routes_v2/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        @user = User.all

INSERT INTO "users" ("name", "email") VALUES (?, ?)  [["name", "Danny"], ["email", "danny@gmail.com"]]
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = ? WHERE "users"."id" = ?  [["email", "ben@icloud.com"], ["id", 2]]
---
    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
    def destroy
        user = User.find_by(id: params[:id])
        if user.destroy