W6D5/cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "name" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["birth_date", "2012-08-17"], ["color", "Violet"], ["name", "Lynn Version 2"], ["sex", "F"], ["description", "Likes to eat ramen"], ["updated_at", "2021-08-13 23:26:54.264550"], ["id", 2]]
---
    def update
        @cat= Cat.find_by(id: params[:id])
        unless @cat
            render json: {error: 'cat not found'}
            return
        end

        if @cat.update(cat_params)